<?php
// +----------------------------------------------------------------------
// | ThinkPHP [ WE CAN DO IT JUST THINK ]
// +----------------------------------------------------------------------
// | Copyright (c) 2006~2018 http://thinkphp.cn All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: liu21st <liu21st@gmail.com>
// +----------------------------------------------------------------------

// +----------------------------------------------------------------------
// | 缓存设置
// +----------------------------------------------------------------------

return [
    // 驱动方式
    'type'   => 'File',
    // 缓存保存目录
    'path'   => '',
    // 缓存前缀
    'prefix' => '',
    // 缓存有效期 0表示永久缓存
    'expire' => 0,
];



//'cache' => [
//    // 使用复合缓存类型
//    'type' => 'complex',//complex
//    'is_cache' => false,
//    // 默认使用的缓存
//    'default' => [
//        // 驱动方式
//        'type' => 'File',
//        // 服务器地址
//        'host' => '127.0.0.1',//112.74.104.62
//        //'password' => 'Gdu1q2w3e',
//        'port' => 6379,
//        // 缓存保存目录
//        'path' => CACHE_PATH,
//    ],
//    // 文件缓存
//    'file' => [
//        // 驱动方式
//        'type' => 'file',
//        // 设置不同的缓存保存目录
//        'path' => RUNTIME_PATH . 'file/',
//    ],
//    // redis缓存
//    'redis' => [
//        // 驱动方式
//    ],
//    // 缓存前缀
//    'prefix' => 'gdu_tech',
//    'tag' => 'gdu_tech',
//    // 缓存有效期 0表示永久缓存
//    'expire' => 3600 * 24 * 3,
//],